'''
时间
姓名、年龄、职业、家庭，爱好，家乡
亲密关系
用户当前行为
生理状态
心理状态
饮食偏好
位置信息
长期目标
近期关注的事情
'''

config = {
  "当前时间": "日期，时间，星期几",
  "基本档案": {
    "姓名": "",
    "称呼偏好": "",
    "年龄": "",
    "职业": "",
    "家乡": "",
    "家庭状况": "",
    "爱好": [""]
  },
  "生理状态": {
    "健康状况": "有什么疾病或身体限制",
    "酒精/药物摄入记录": {"最近是否喝了酒和喝酒的时间"},
    "其他": ""
  },
  "心理状态": {
    "当前情绪": "",
  },
  "亲密关系": {
    "伴侣": "",
    "重要他人": ["", ""],
  },
  "当前位置与环境": {
    "地理坐标": "",
    "语义位置": "",
  },
  "用户当前行为": {
    "动作": ""
  },
  "饮食偏好": {
    "口味": "",
    "忌口": "",
  },
  "目标与关注": {
    "长期目标": ["",""],
    "近期关注": [
      "",
      "",
    ]
  }
}